# 문제1
---
데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후,
'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기

In [23]:
import pandas as pd
df = pd.read_csv('./basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [24]:
df = df.sort_values('f5',ascending=False)
df = df.reset_index(drop=True)
df

      id   age city    f1  f2   f3    f4         f5
0   id11  40.0   서울  68.0   0  NaN  ENFP  98.429899
1   id98  39.0   경기  58.0   2  NaN  INFP  98.429899
2   id10  95.0   서울  74.0   1  NaN  ISFP  98.429899
3   id77  77.0   경기  31.0   0  NaN  INFP  98.429899
4   id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034
..   ...   ...  ...   ...  ..  ...   ...        ...
95  id55  75.0   대구  63.0   2  NaN  ENTP  13.049921
96  id36  68.0   부산  77.0   1  NaN  INTP  13.049921
97  id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
98  id91   6.0   경기  72.0   0  NaN  INTP   9.796378
99  id15  22.0   서울  67.0   1  NaN  ENTP   9.796378

[100 rows x 8 columns]

In [25]:
min = df['f5'][:10].min()
min

91.29779092

In [27]:
df.iloc[:10,-1] = min
df

      id   age city    f1  f2   f3    f4         f5
0   id11  40.0   서울  68.0   0  NaN  ENFP  91.297791
1   id98  39.0   경기  58.0   2  NaN  INFP  91.297791
2   id10  95.0   서울  74.0   1  NaN  ISFP  91.297791
3   id77  77.0   경기  31.0   0  NaN  INFP  91.297791
4   id99   1.0   경기  47.0   0  NaN  ESFJ  91.297791
..   ...   ...  ...   ...  ..  ...   ...        ...
95  id55  75.0   대구  63.0   2  NaN  ENTP  13.049921
96  id36  68.0   부산  77.0   1  NaN  INTP  13.049921
97  id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
98  id91   6.0   경기  72.0   0  NaN  INTP   9.796378
99  id15  22.0   서울  67.0   1  NaN  ENTP   9.796378

[100 rows x 8 columns]

In [28]:
result = df[df['age']>=80]['f5'].mean()
print(result)

62.49774712521738

# 문제2 
---
데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,  
'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고   
두 표준편차 차이 계산하기

In [43]:
# 라이브러리 및 데이터 불러오기
import pandas as pd

df = pd.read_csv('./basic1.csv')
df.head()
df.shape

(100, 8)

In [44]:
df = df.iloc[:int(len(df)*0.7)]
df.shape

(70, 8)

In [45]:
df.isnull().sum()

id       0
age      0
city     0
f1      23
f2       0
f3      67
f4       0
f5       0
dtype: int64

In [46]:
before = df['f1'].std()

In [47]:
df['f1'] = df['f1'].fillna(df['f1'].median())
after =df['f1'].std()

In [48]:
print(before - after)

3.2965018033960725

# 문제3
---
데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!  
단, 평균으로부터 '표준편차*1.5'를 벗어나는 영역을 이상치라고 판단함

In [49]:
# 라이브러리 및 데이터 불러오기
import pandas as pd

df = pd.read_csv('./basic1.csv')
df.head()
df.shape

(100, 8)

In [51]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [52]:
cond1 = df['age'].mean() + df['age'].std()*1.5
cond2 = df['age'].mean() - df['age'].std()*1.5

In [54]:
a1 = df[df['age']>cond1]['age']
a2 = df[df['age']<cond2]['age']
print(a1.sum()+a2.sum())

473.5